app/controllers/api/comments_controller.rb

INSERT INTO "comments" ("text", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "Your comment content"], ["user_id", 7], ["post_id", 21], ["created_at", "2024-02-03 09:11:58.521928"], ["updated_at", "2024-02-03 09:11:58.521928"]]
---
  def create
    Rails.logger.info('Create action reached!')

    @comment = @post.comments.build(comment_params.merge(user: @user))

    if @comment.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
  def set_user_and_post
    @user = User.find_by(id: params[:user_id])
    @post = @user&.posts&.find_by(id: params[:post_id])