app/controllers/comments_controller.rb

INSERT INTO "comments" ("text", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "th is comment enter from form"], ["user_id", 1], ["post_id", 1], ["created_at", "2024-01-26 20:47:06.056507"], ["updated_at", "2024-01-26 20:47:06.056507"]]
---
  def create
    @comment = current_user.comments.build(comment_params)
    @comment.post = @post

    if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 23]]
---
 def destroy
  @comment = Comment.find(params[:id])
  authorize! :destroy, @comment
  @comment.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
def set_user_and_post
  @user = User.find(params[:user_id])
  @post = Post.find(params[:post_id])