app/controllers/posts_controller.rb

  def index
    @posts = @user.posts.includes(:comments)
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2, $3, $4, $5)  [["post_id", 6], ["post_id", 7], ["post_id", 8], ["post_id", 9], ["post_id", 10]]

  def show
    @comments = @post.comments.includes(:user)
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]

  def create
    @post = Post.new(post_params)
    @post.author = current_user
    @post.comments_counter = 0
    @post.likes_counter = 0

    if @post.save
---
INSERT INTO "posts" ("title", "text", "comments_counter", "likes_counter", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    authorize! :destroy, @post
    @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 16]]

  def set_user
    @user = User.find_by(id: params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]